#define _CRT_SECURE_NO_WARNINGS
#include <stdio.h>
#include <string.h>

//int main()
//{
//	int a = 10;
//	float f = 10.0;
//	return 0;
//}

//void test()
//{
//	printf("hehe\n");
//}
//int main()
//{
//	test();
//	return 0;
//}
 
//原码
//反码
//补码

//int main()
//{
//	int a = 20;//4个字节，32个比特位
//	//00000000000000000000000000010100--原码
//	//00000000000000000000000000010100--反码
//	//00000000000000000000000000010100--补码
//	int b = -10;
//	//10000000000000000000000000001010--原码
//	//11111111111111111111111111110101--反码
//	//10000000000000000000000000001010--补码
//	int w = 0x44332211;
//	//大端字节序存储模式--44332211
//	//小端字节序存储模式--11223344
//	printf("%d\n",w);
//	return 0;
//} 

//判断本机器为大端还是小端
//int main()
//{
//	int a = 1;
//	char*p=(char*)&a;
//	if(*p == 1)
//	{
//		printf("小端");
//	}
//	else
//	{
//		printf("大端");
//	}
//	return 0;
//}

//第一种
//int check_sys()
//{
//	int a = 1;
//	char*p=(char*)&a;
//	if(*p==1)
//		return 1;
//	else
//		return 0;
//}
//第二种
//int check_sys()
//{
//	int a = 1;
//	char*p=(char*)&a;
//	return *p;
//}
//第三种
//int check_sys()
//{
//	int a = 1;
//	return *(char*)&a; 
//}
//int main()
//{
//	//写一段代码判断本机器是大端还是小端
//	int ret = check_sys();
//	//1为小端
//	//返回0为大端
//	if(ret == 1)
//	{
//		printf("小端\n");
//	}
//	else
//	{
//		printf("大端\n");
//	}
//	return 0;
//
//}

//int main()
//{
//	char a = 128;//%d打印十进制有符号数字  %u打印十进制无符号数字
//	printf("%u",a);
//	return 0;
//}   

//-20 + 10
//10000000 00000000 00000000 00010100 --原码 -20
//11111111 11111111 11111111 11101011 --反码 -20
//11111111 11111111 11111111 11101100 --补码 -20
//00000000 00000000 00000000 00001010 --补码 10
//11111111 11111111 11111111 11110110  --结果 补码
//00000000 00000000 00000000 00001010 --原码 10

//int main()
//{
//	char a [1000];
//	int i;
//	for(i=0;i<1000;i++)
//	{
//		a[i] = -1 - i;
//	}
//	printf("%d",strlen(a));
//	return 0;
//}

int main()
{
	int n = 9;
    //0 00000000 00000000000000000001001
	float*pf = (float*)&n;
	printf("%d\n",n);
	printf("%f\n",*pf);
    //0.00000000000000000001001 * 2^-126 -- 无限接近于零

	*pf = 9.0;
    //0 10000010 00100000000000000000000
	//0100 0001 0001 0000 0000 0000 0000 0000
	printf("%d\n",n);
	printf("%f\n",*pf);
	return 0;
}

//（-1）^S * M * 2^E
//5
//(-1)^0 * 1.01 * 2^2
//S + E + M
//1.01的整数位无需计算，出内存时会自动补一
//S(1) + E(8) + M(23) --32比特位 E + 127
//S(1) + E(11) + M(52) --64比特位 E + 1023
//010000001010000000000000000000000
//0100 0000 1010 0000 0000 0000 0000 0000
//4    0    a    0    0    0    0    0
//40 a0 00 00 --小端存储
 
/*E非全零或全一 -- E-127(32bit)&E-1023(64)
如0 10000001 01000000000000000000000
 0  00000010 01000000000000000000000
 -1^（0）* 1.01 * 2^2
 101 5 */

//int main()
//{
//
//	float a = 5.5;
//	//5.5
//	//101.1
//	//0 10000001 01100000000000000000000
//	//01000000101100000000000000000000
//	//0100 0000 1011 0000 0000 0000 0000 0000
//	//4 0 b 0 0 0 0 0
//	// 40 b0 00 00
//	return 0;
//}